In [11]:
import numpy as np
import pandas as pd

In [12]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [13]:
data

{'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2],
 'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003]}

In [14]:
D1= pd.DataFrame(data)
D1

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [25]:
D2= pd.DataFrame(data, index=['a','b','c','d','e','f'], columns=['year','pop','state'])
D2

   year  pop   state
a  2000  1.5    Ohio
b  2001  1.7    Ohio
c  2002  3.6    Ohio
d  2001  2.4  Nevada
e  2002  2.9  Nevada
f  2003  3.2  Nevada

In [23]:
D2.head()    # By default 5 rows will be provided.

    state  year  pop
a    Ohio  2000  1.5
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9

In [24]:
D2.tail()    # last 5 rows

    state  year  pop
b    Ohio  2001  1.7
c    Ohio  2002  3.6
d  Nevada  2001  2.4
e  Nevada  2002  2.9
f  Nevada  2003  3.2

In [26]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                              index=['one', 'two', 'three', 'four','five', 'six'])   #Adding a column in data frame.
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [27]:
D2.columns

Index(['year', 'pop', 'state'], dtype='object')

In [28]:
D2.index

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')

In [29]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [30]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [31]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [33]:
frame2.loc['three']    # .loc is used to get row in data frame.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
frame2['debt']= 0    all values will be updated with 0.

In [35]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     0
three  2002    Ohio  3.6     0
four   2001  Nevada  2.4     0
five   2002  Nevada  2.9     0
six    2003  Nevada  3.2     0

In [40]:
frame2['debt']= [1,2,3,4,5,6]   # Manually updated the values of a column.

In [41]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     1
two    2001    Ohio  1.7     2
three  2002    Ohio  3.6     3
four   2001  Nevada  2.4     4
five   2002  Nevada  2.9     5
six    2003  Nevada  3.2     6

In [42]:
frame2['debt']= np.arange(6)    # we can update values upto any range.
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

In [43]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [45]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [50]:
print(frame2)
frame2.state == 'Ohio'
frame2['Boolean'] = frame2.state == 'Ohio'

       year   state  pop  debt  Boolean
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [52]:
frame2.Boolean

one       True
two       True
three     True
four     False
five     False
six      False
Name: Boolean, dtype: bool

In [53]:
# New columns cannot be created with the frame2.eastern syntax.

In [60]:
frame2

       year   state  debt  Boolean
one    2000    Ohio   NaN     True
two    2001    Ohio  -1.2     True
three  2002    Ohio   NaN     True
four   2001  Nevada  -1.5    False
five   2002  Nevada  -1.7    False
six    2003  Nevada   NaN    False

In [61]:
del frame2['debt']
frame2

       year   state  Boolean
one    2000    Ohio     True
two    2001    Ohio     True
three  2002    Ohio     True
four   2001  Nevada    False
five   2002  Nevada    False
six    2003  Nevada    False

In [63]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},
        'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [68]:
d1= pd.DataFrame(pop, index=[2000,2001,2002])
d1

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [71]:
pdata = {'Ohio': d1['Ohio'][:-1],
          'Nevada': d1['Nevada'][:2]}
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [72]:
 pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [73]:
d1.index.name = 'year'; d1.columns.name = 'state'
d1

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [74]:
d1.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])